run/vortexSheddingLES/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    in
    {
        type            fixedValue;
        value           uniform (0.39 0 0);
    }
    
    sym1
    {
    	 type		 symmetryPlane;
    }
    
    sym2
    {
    	 type		 symmetryPlane;
    }

    out
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0.39 0 0);
    }
    
    front
    {
    	 type		  symmetryPlane;
    }
    
    back
    {
    	 type		  symmetryPlane;
    }
    
    cylinder
    {
    	 type		  fixedValue;
    	 value		  uniform (0 0 0);
    }
}


// ************************************************************************* //
