run/vortexSheddingLES/0_orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in
    {
        type		zeroGradient;
        //type            fixedValue;
        //value		 uniform 0.0183;
    }
    
    sym1
    {
    	 type		 symmetryPlane;
    }
    
    sym2
    {
    	 type		  symmetryPlane;
    }

    out
    {
        type            zeroGradient;
    }
    
    front
    {
    	 type		  symmetryPlane;
    }
    
    back
    {
    	 type		  symmetryPlane;
    }
    
    cylinder
    {
    	 type		  nutkWallFunction;
    	 value		  uniform 0.0;
    }
}


// ************************************************************************* //
