run/vortexSheddingLES/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in
    {
        type            zeroGradient;
    }
    
    sym1
    {
    	 type		 symmetryPlane;
    }
    
    sym2
    {
    	 type		  symmetryPlane;
    }

    out
    {
        type            fixedValue;
        value		 uniform 0;
    }
    
    front
    {
    	 type		  symmetryPlane;
    }
    
    back
    {
    	 type		  symmetryPlane;
    }
    
    cylinder
    {
    	 type		  zeroGradient;
    }
}
// ************************************************************************* //
